# Import Panda

In [2]:
import pandas as pd

# Series

In [3]:
#Creating a series from a list
data = [10,20,30,40,50]
series = pd.Series(data)
series

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [4]:
type(series)

pandas.core.series.Series

In [5]:
# Custom Indexing in series
custom_index=['A','B','C','D','E']
series_with_custom_index= pd.Series(data,index=custom_index)
series_with_custom_index

A    10
B    20
C    30
D    40
E    50
dtype: int64

In [6]:
print(series_with_custom_index['B']) # accessing the item with index "B"

20

# Pandas DataFrames

### it make two dimensional sql or spreadsheet

In [7]:
import pandas as pd

#creating a dataframe from a dictonary

data={
    'Name' : ['alice','bob','ihsanul'],
    'Age'  : [12,23,56],
    'City' : ["NY","ML","DHK"]
}
df = pd.DataFrame(data)
df

      Name  Age City
0    alice   12   NY
1      bob   23   ML
2  ihsanul   56  DHK

In [7]:
# Apply custom index on df

custom_index=["101","102","103"]
df_with_custom_index = pd.DataFrame(data,index=custom_index)
df_with_custom_index

        Name  Age City
101    alice   12   NY
102      bob   23   ML
103  ihsanul   56  DHK

# Data Selection& Indexing

### Column Selection

In [8]:
import pandas as pd

#creating a dataframe from a dictonary

data={
    'Name' : ['alice','bob','ihsanul'],
    'Age'  : [12,23,56],
    'City' : ["NY","ML","DHK"]
}
df = pd.DataFrame(data)
df

      Name  Age City
0    alice   12   NY
1      bob   23   ML
2  ihsanul   56  DHK

In [8]:
# Selecting specific columns by name

#Getting column

df [['Name']]

      Name
0    alice
1      bob
2  ihsanul

In [9]:
df[['Name','Age']]

      Name  Age
0    alice   12
1      bob   23
2  ihsanul   56

# iloc & loc

In [10]:
row_2=df.iloc[2]
row_2

Name    ihsanul
Age          56
City        DHK
Name: 2, dtype: object

## index location = iloc

In [11]:
#selecting rows using iloc[]
selected_rows=df.iloc[1:3] #integer based indexing
selected_rows

      Name  Age City
1      bob   23   ML
2  ihsanul   56  DHK

In [11]:
# Selecting rows using loc[] (Label-Based indexing)
# Apply custom index on df

custom_index = ['ID1','ID2','ID3']
df_with_custom_index=pd.DataFrame(data,index=custom_index)
df_with_custom_index

        Name  Age City
ID1    alice   12   NY
ID2      bob   23   ML
ID3  ihsanul   56  DHK

In [13]:
df_with_custom_index.loc['ID2':'ID3']

        Name  Age City
ID2      bob   23   ML
ID3  ihsanul   56  DHK

# Query

##### query method allow you filter rows based on a query expression

In [20]:
import pandas as pd

#creating a dataframe from a dictonary
data={
    'Name' : ['alice','bob','ihsanul','kuddus'],
    'Age'  : [12,23,10,40],
    'City' : ['NY','ML','DHK','BBN']
}

df = pd.DataFrame(data)
df

      Name  Age City
0    alice   12   NY
1      bob   23   ML
2  ihsanul   10  DHK
3   kuddus   40  BBN

In [21]:
#Filtering rows using query expression
filtered = df.query('Age>20')
filtered

     Name  Age City
1     bob   23   ML
3  kuddus   40  BBN

In [23]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul'],
    'Age' : [12,23,13],
    'City' : ["NY", "UK", "Dhaka"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

#### Describe()

In [25]:
df.describe()

             Age
count   3.000000
mean   16.000000
std     6.082763
min    12.000000
25%    12.500000
50%    13.000000
75%    18.000000
max    23.000000

## Head( ) & Tail ()

In [30]:
## Head shows data form the top and Tail shows the data from down position

In [26]:
import pandas as pd

# Creating a DataFrame from a Dictionary
data = {
    'Name' : ['Alice', 'Bob', 'Ihsanul',"Hasan", "Mahadi", "Sami", "Sadi", "Siam"],
    'Age' : [12,23,13,12,2,13,4,5],
    'City' : ["NY", "UK", "Dhaka","NY", "UK", "Dhaka","NY", "UK"]
}

df = pd.DataFrame(data)
df

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka
3    Hasan   12     NY
4   Mahadi    2     UK
5     Sami   13  Dhaka
6     Sadi    4     NY
7     Siam    5     UK

In [27]:
df.head()

      Name  Age   City
0    Alice   12     NY
1      Bob   23     UK
2  Ihsanul   13  Dhaka
3    Hasan   12     NY
4   Mahadi    2     UK

In [29]:
df.tail()

     Name  Age   City
3   Hasan   12     NY
4  Mahadi    2     UK
5    Sami   13  Dhaka
6    Sadi    4     NY
7    Siam    5     UK

In [31]:
df.tail(3)

   Name  Age   City
5  Sami   13  Dhaka
6  Sadi    4     NY
7  Siam    5     UK

In [32]:
#Value_Count()


df['City'].value_counts()

City
NY       3
UK       3
Dhaka    2
Name: count, dtype: int64

In [33]:
df['Age'].value_counts()

Age
12    2
13    2
23    1
2     1
4     1
5     1
Name: count, dtype: int64

## Data Cleaning & Handling

In [15]:
import pandas as pd
#Creating a sample dataframe
data ={
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}
df = pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [35]:
import pandas as pd

# Creating a sample dataframe

data={
    'A':[1,2,3],
    'B':[4,5,6],
    'C':[7,8,9]
}
df=pd.DataFrame(data)
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [36]:
# Dropping a column 'C' by specifying axis = 1

df_dropped_col=df.drop('C',axis=1)
df_dropped_col

   A  B
0  1  4
1  2  5
2  3  6

In [37]:
df

   A  B  C
0  1  4  7
1  2  5  8
2  3  6  9

In [38]:
#Inplace (changing in main memory)

df.drop('B',axis=1,inplace=True)

In [39]:
df

   A  C
0  1  7
1  2  8
2  3  9

In [40]:
df.drop([0,2])

   A  C
1  2  8

# Fillna()

In [41]:
df_with_null=pd.DataFrame({
    
    'A':[1,2,None,4],
    'B':[5,None,7,8]
                          
})
df_with_null

     A    B
0  1.0  5.0
1  2.0  NaN
2  NaN  7.0
3  4.0  8.0

In [23]:
#Filling mission values with a specific value
df_filled=df_with_null.fillna(0)

In [24]:
df_filled

     A    B
0  1.0  5.0
1  2.0  0.0
2  0.0  7.0
3  4.0  8.0

# Drop_Duplicated()
Remove Duplicate Rows

In [56]:
data_duplicates={
    'A':[1,2,1,4,5],
    'B':['a','v','a','y','z']
}
df=pd.DataFrame(data_duplicates)
df

   A  B
0  1  a
1  2  v
2  1  a
3  4  y
4  5  z

In [57]:
df.drop_duplicates(inplace=True)

In [58]:
df

   A  B
0  1  a
1  2  v
3  4  y
4  5  z

In [34]:
data={
    'A':[1,2,3,4,5],
    'B':['a','v','a','y','z']
}
df=pd.DataFrame(data)
df

   A  B
0  1  a
1  2  v
2  3  a
3  4  y
4  5  z

# Replace values

In [59]:
df.replace({'a':'NEWK'},inplace=True)

In [60]:
df

   A     B
0  1  NEWK
1  2     v
3  4     y
4  5     z

# Data Aggregation & Grouping

### Groupby()

In [39]:
import pandas as pd
print([1,2,3,None])

[1, 2, 3, None]

In [61]:
import pandas as pd
data={
    'Cat':['A','B','C','A','B'],
    'Values':[10,25,30,15,12]
}
df=pd.DataFrame(data)
df

  Cat  Values
0   A      10
1   B      25
2   C      30
3   A      15
4   B      12

In [62]:
grouped=df.groupby('Cat')

In [63]:
for name,group in grouped:
    print(name)
    print(group)

A
  Cat  Values
0   A      10
3   A      15
B
  Cat  Values
1   B      25
4   B      12
C
  Cat  Values
2   C      30

# agg()
Apply aggregation functions(sum,mean,etc) on group data

In [46]:
aggregated=grouped.agg({'Values':['sum','mean']})
aggregated

    Values
       sum  mean
Cat
A       25  12.5
B       37  18.5
C       30  30.0


# Data Transformation
##### pivot_table()

In [70]:
import pandas as pd

data={
    'Date':['2022-01-01','2022-01-01','2023-06-03','2021-01-02','2021-01-02'],
    'Name':['A','B','C','A','B'],
    'Price':[10,25,30,15,12]
}
df=pd.DataFrame(data)
df

         Date Name  Price
0  2022-01-01    A     10
1  2022-01-01    B     25
2  2023-06-03    C     30
3  2021-01-02    A     15
4  2021-01-02    B     12

In [71]:
# Creating a pivot table to summarize data
pivot = df.pivot_table(values='Price', index='Date', columns='Name', aggfunc='sum')
pivot

Name           A     B     C
Date
2021-01-02  15.0  12.0   NaN
2022-01-01  10.0  25.0   NaN
2023-06-03   NaN   NaN  30.0

# Astype

In [74]:
data={
    "Num" : [1,2,3]
}
df=pd.DataFrame(data)
df

   Num
0    1
1    2
2    3

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Num     3 non-null      int64
dtypes: int64(1)
memory usage: 156.0 bytes

### Convert  int to string

In [80]:
df['Num']=df['Num'].astype(str)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Num     3 non-null      object
dtypes: object(1)
memory usage: 156.0+ bytes

In [83]:
import pandas as pd
df = pd.read_csv('Datasets/healthcare-dataset-stroke-data.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5110 entries, 0 to 5109
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5110 non-null   int64
 1   gender             5110 non-null   object
 2   age                5110 non-null   float64
 3   hypertension       5110 non-null   int64
 4   heart_disease      5110 non-null   int64
 5   ever_married       5110 non-null   object
 6   work_type          5110 non-null   object
 7   Residence_type     5110 non-null   object
 8   avg_glucose_level  5110 non-null   float64
 9   bmi                4909 non-null   float64
 10  smoking_status     5110 non-null   object
 11  stroke             5110 non-null   int64
dtypes: float64(3), int64(4), object(5)
memory usage: 479.2+ KB

In [84]:
df.head()

,id,gender,age,hypertension,heart_disease,ever_married,work_type,Residence_type,avg_glucose_level,bmi,smoking_status,stroke
0,9046,Male,67.0,0,1,Yes,Private,Urban,228.69,36.6,formerly smoked,1
1,51676,Female,61.0,0,0,Yes,Self-employed,Rural,202.21,NaN,never smoked,1
2,31112,Male,80.0,0,1,Yes,Private,Rural,105.92,32.5,never smoked,1
3,60182,Female,49.0,0,0,Yes,Private,Urban,171.23,34.4,smokes,1
4,1665,Female,79.0,1,0,Yes,Self-employed,Rural,174.12,24.0,never smoked,1

## Writing CSV File

In [85]:
import pandas as pd
#creating a dataframe from a dictonary
data={
    'Name' : ['alice','bob','ihsanul'],
    'Age'  : [12,23,56],
    'City' : ["NY","ML","DHK"]
}
df = pd.DataFrame(data)
df

      Name  Age City
0    alice   12   NY
1      bob   23   ML
2  ihsanul   56  DHK

In [86]:
#writing the df to a csv file
df.to_csv('Datasets/output.csv',index=False)

## Reading Excel File

In [89]:
# Reading a excel file into df
df = pd.read_excel('Datasets/students.xlsx',sheet_name='Sheet1')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Id      3 non-null      int64
 1   name    3 non-null      object
 2   dept    3 non-null      object
 3   cgpa    3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 228.0+ bytes

In [90]:
df.head()

    Id        name dept  cgpa
0  111     Jon Doe  ECE  3.90
1  121    Jon Snow  BBA  3.33
2  232  Alice Cuba  ECO  3.55

## Writing Excel File

In [91]:
import pandas as pd
#creating a dataframe from a dictonary 
data={
    'Name': ['Alice','Bob','Caumin'],
    'Age' : [23,12,42],
    'City': ["NY","ML","LA"]
}
df=pd.DataFrame(data)
df

     Name  Age City
0   Alice   23   NY
1     Bob   12   ML
2  Caumin   42   LA

In [95]:
df.to_excel('Datasets/outputfromanothertable.xlsx',sheet_name='Sheet 2')